#### Terraform Plan for `staging` Environment

**Status:** ❌ Plan failed

**Terraform Version:** `1.6.0`
**Workspace:** `staging`
**Config File:** `environments/staging.tfvars`

<details><summary>📋 Show Plan Details</summary>

```terraform
data.archive_file.function_source: Reading...
data.archive_file.function_source: Read complete after 0s [id=1cd06cc8efde25c0e3cac64f88fa07d9afbaccc7]
google_project_service.cloud_build: Refreshing state... [id=gen-lang-client-0805519538/cloudbuild.googleapis.com]
google_project_service.cloud_run: Refreshing state... [id=gen-lang-client-0805519538/run.googleapis.com]
google_project_service.firestore: Refreshing state... [id=gen-lang-client-0805519538/firestore.googleapis.com]
google_project_service.drive: Refreshing state... [id=gen-lang-client-0805519538/drive.googleapis.com]
google_project_service.cloud_functions: Refreshing state... [id=gen-lang-client-0805519538/cloudfunctions.googleapis.com]
google_project_service.aiplatform: Refreshing state... [id=gen-lang-client-0805519538/aiplatform.googleapis.com]
google_service_account.function_sa: Refreshing state... [id=projects/gen-lang-client-0805519538/serviceAccounts/v2v2b-interrogator-staging-sa@gen-lang-client-0805519538.iam.gserviceaccount.com]
google_project_iam_member.firestore_user: Refreshing state... [id=gen-lang-client-0805519538/roles/datastore.user/serviceAccount:v2v2b-interrogator-staging-sa@gen-lang-client-0805519538.iam.gserviceaccount.com]
google_project_iam_member.aiplatform_user: Refreshing state... [id=gen-lang-client-0805519538/roles/aiplatform.user/serviceAccount:v2v2b-interrogator-staging-sa@gen-lang-client-0805519538.iam.gserviceaccount.com]
google_project_iam_member.logging_writer: Refreshing state... [id=gen-lang-client-0805519538/roles/logging.logWriter/serviceAccount:v2v2b-interrogator-staging-sa@gen-lang-client-0805519538.iam.gserviceaccount.com]
google_firestore_database.database: Refreshing state... [id=projects/gen-lang-client-0805519538/databases/(default)]
google_storage_bucket.function_bucket: Refreshing state... [id=gen-lang-client-0805519538-v2v2b-function-source]
google_storage_bucket_object.function_source: Refreshing state... [id=gen-lang-client-0805519538-v2v2b-function-source-function-source-e012571523a85fffb2b1fa9decb803fa.zip]
google_firebaserules_ruleset.firestore[0]: Refreshing state... [id=projects/gen-lang-client-0805519538/rulesets/57a78e5e-0ae1-4082-ab2d-ce233d2310dc]
google_cloudfunctions2_function.v2v2b_interrogator: Refreshing state... [id=projects/gen-lang-client-0805519538/locations/us-central1/functions/v2v2b-interrogator-staging]
google_cloud_run_service_iam_member.public_access: Refreshing state... [id=v1/projects/gen-lang-client-0805519538/locations/us-central1/services/v2v2b-interrogator-staging/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # google_cloudfunctions2_function.v2v2b_interrogator will be updated in-place
  ~ resource "google_cloudfunctions2_function" "v2v2b_interrogator" {
        id               = "projects/gen-lang-client-0805519538/locations/us-central1/functions/v2v2b-interrogator-staging"
        name             = "v2v2b-interrogator-staging"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "function-source-e012571523a85fffb2b1fa9decb803fa.zip" -> "function-source-a4ec285e05d96c027db7d8c15e993683.zip"
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = (sensitive value)
            # (11 unchanged attributes hidden)
        }
    }

  # google_storage_bucket_object.function_source must be replaced
-/+ resource "google_storage_bucket_object" "function_source" {
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "WmTkhg==" -> (known after apply)
      ~ detect_md5hash   = "4BJXFSOoX/+ysfqd7LgD+g==" -> "different hash"
      - event_based_hold = false -> null
      ~ generation       = 1764365228478289 -> (known after apply)
      ~ id               = "gen-lang-client-0805519538-v2v2b-function-source-function-source-e012571523a85fffb2b1fa9decb803fa.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "4BJXFSOoX/+ysfqd7LgD+g==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/gen-lang-client-0805519538-v2v2b-function-source/o/function-source-e012571523a85fffb2b1fa9decb803fa.zip?generation=1764365228478289&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "function-source-e012571523a85fffb2b1fa9decb803fa.zip" -> "function-source-a4ec285e05d96c027db7d8c15e993683.zip" # forces replacement
      ~ output_name      = "function-source-e012571523a85fffb2b1fa9decb803fa.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/gen-lang-client-0805519538-v2v2b-function-source/o/function-source-e012571523a85fffb2b1fa9decb803fa.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Error: Error when reading or editing FirebaserulesRuleset "projects/gen-lang-client-0805519538/rulesets/57a78e5e-0ae1-4082-ab2d-ce233d2310dc": googleapi: Error 403: The caller does not have permission

  with google_firebaserules_ruleset.firestore[0],
  on main.tf line 270, in resource "google_firebaserules_ruleset" "firestore":
 270: resource "google_firebaserules_ruleset" "firestore" {

::error::Terraform exited with code 1.
```

</details>

---

**Next Steps:**
1. ✅ Review the plan carefully
2. ✅ Ensure security scans passed
3. ✅ Approve PR to merge to `develop`

*Pusher: @google-labs-jules[bot] | Run: [#34](https://github.com/lordmuffin/Maestro/actions/runs/19774526558)*